# CurveExtents Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveExtents Class
Members See Also
---
Represents the start and end parameters for a curve segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class CurveExtents : IDisposable
```

Visual Basic
---
```text
Public Class CurveExtents _
	Implements IDisposable
```

Visual C++
---
```text
public ref class CurveExtents : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..CurveExtents
# See Also
CurveExtents Members
Autodesk.Revit.DB Namespace